wagiminator/Development-Boards/PY32F002AF15P_DevBoard/software/blink/include/gpio.h
#define ADC_input(PIN) \
  ((PIN>=PA0)&&(PIN<=PA7) ? ( ADC1->CHSELR =  (PIN)&7    ) : \
  ((PIN>=PB0)&&(PIN<=PB1) ? ( ADC1->CHSELR = ((PIN)&7)+8 ) : \
(0)))

static inline void ADC_enable(void) {
  ADC1->ISR = 0xff;                             // clear ADC flags
  ADC1->CR |= ADC_CR_ADEN;                      // enable ADC
  ADC->CCR  = ADC_CCR_TSEN | ADC_CCR_VREFEN;    // enable VREF and TEMP
}

static inline void ADC_disable(void) {
  ADC->CCR = 0;                                 // disable VREF and TEMP
  if(ADC1->CR & ADC_CR_ADSTART) {               // ADC still converting?
    ADC1->CR |= ADC_CR_ADSTP;                   // stop ongoing conversion
    while(ADC1->CR & ADC_CR_ADSTP);             // wait for conversion stopped
  }
  ADC1->CR &= ~ADC_CR_ADEN;                     // disable ADC
}

static inline void ADC_init(void) {
  RCC->APBENR2 |= RCC_APBENR2_ADCEN;            // power on ADC
  ADC1->CR = ADC_CR_ADCAL;                      // start calibration
  while(ADC1->CR & ADC_CR_ADCAL);               // wait until finished
  ADC1->CFGR2 = (uint32_t)0b1011 << 28;         // set HSI/8 as ADC clock source
  ADC1->SMPR = 0b110;                           // sampling time = 71.5 ADC clock cycles
  ADC_enable();                                 // turn on ADC
}

static inline uint16_t ADC_read(void) {
  ADC1->CR |= ADC_CR_ADSTART;                   // start conversion
  while(ADC1->CR & ADC_CR_ADSTART);             // wait until finished
  return ADC1->DR;                              // return result
}

static inline uint16_t ADC_read_VDD(void) {
  ADC_input_VREF();                             // set VREF as ADC input
  return((uint32_t)1200 * 4096 / ADC_read());   // return VDD in mV
}

static inline int8_t ADC_read_TEMP(void) {
  ADC_input_TEMP();                             // set temp sensor as ADC input
  // return temp in °C
  return(((int32_t)ADC_read()-ADC_TSCAL1)*(55/(ADC_TSCAL2-ADC_TSCAL1))+30);
}

#ifdef __cplusplus
};
#endif
